# **21. 조건에 맞는 회원수 구하기(250211)(SELECT)**

In [ ]:
# 문제 설명
# 다음은 어느 의류 쇼핑몰에 가입한 회원 정보를 담은 USER_INFO 테이블입니다.
# USER_INFO 테이블은 아래와 같은 구조로 되어있으며 USER_ID, GENDER, AGE, JOINED는 각각 회원 ID, 성별, 나이, 가입일을 나타냅니다.

# Column name	Type	Nullable
# USER_ID	INTEGER	FALSE
# GENDER	TINYINT(1)	TRUE
# AGE	INTEGER	TRUE
# JOINED	DATE	FALSE
# GENDER 컬럼은 비어있거나 0 또는 1의 값을 가지며 0인 경우 남자를, 1인 경우는 여자를 나타냅니다.

# 문제
# USER_INFO 테이블에서 2021년에 가입한 회원 중 나이가 20세 이상 29세 이하인 회원이 몇 명인지 출력하는 SQL문을 작성해주세요.

# 예시
# 예를 들어 USER_INFO 테이블이 다음과 같다면

# USER_ID	GENDER	AGE	JOINED
# 1	1	26	2021-10-05
# 2	0	NULL	2021-11-25
# 3	1	22	2021-11-30
# 4	0	31	2021-12-03
# 5	0	28	2021-12-16
# 6	1	24	2022-01-03
# 7	1	NULL	2022-01-09
# 2021년에 가입한 회원 중 나이가 20세 이상 29세 이하인 회원은 USER_ID 가 1, 3, 5 인 회원들 이므로, 다음과 같이 결과가 나와야 합니다.

# USERS
# 3

1) 내가 쓴 코드

In [ ]:
# SELECT COUNT(USER_ID) as USER
# FROM USER_INFO
# WHERE JOINED LIKE '2021%'
# AND AGE >= '20'
# AND AGE <= '29'

2) gpt 제안 코드

In [ ]:
# SELECT COUNT(*) AS USERS
# FROM USER_INFO
# WHERE YEAR(JOINED) = 2021
# AND AGE BETWEEN 20 AND 29;

# **22. 흉부외과 또는 일반외과 의사 목록 출력하기(250212)(SELECT)**

In [ ]:
# 문제 설명
# 다음은 종합병원에 속한 의사 정보를 담은DOCTOR 테이블입니다.
# DOCTOR 테이블은 다음과 같으며 DR_NAME, DR_ID, LCNS_NO, HIRE_YMD, MCDP_CD, TLNO는
# 각각 의사이름, 의사ID, 면허번호, 고용일자, 진료과코드, 전화번호를 나타냅니다.

# Column name	Type	Nullable
# DR_NAME	VARCHAR(20)	FALSE
# DR_ID	VARCHAR(10)	FALSE
# LCNS_NO	VARCHAR(30)	FALSE
# HIRE_YMD	DATE	FALSE
# MCDP_CD	VARCHAR(6)	TRUE
# TLNO	VARCHAR(50)	TRUE
# 문제
# DOCTOR 테이블에서 진료과가 흉부외과(CS)이거나 일반외과(GS)인 의사의 이름, 의사ID, 진료과, 고용일자를 조회하는 SQL문을 작성해주세요.
# 이때 결과는 고용일자를 기준으로 내림차순 정렬하고, 고용일자가 같다면 이름을 기준으로 오름차순 정렬해주세요.

# 예시
# DOCTOR 테이블이 다음과 같을 때

# DR_NAME	DR_ID	LCNS_NO	HIRE_YMD	MCDP_CD	TLNO
# 루피	DR20090029	LC00010001	2009-03-01	CS	01085482011
# 패티	DR20090001	LC00010901	2009-07-01	CS	01085220122
# 뽀로로	DR20170123	LC00091201	2017-03-01	GS	01034969210
# 티거	DR20100011	LC00011201	2010-03-01	NP	01034229818
# 품바	DR20090231	LC00011302	2015-11-01	OS	01049840278
# 티몬	DR20090112	LC00011162	2010-03-01	FM	01094622190
# 니모	DR20200012	LC00911162	2020-03-01	CS	01089483921
# 오로라	DR20100031	LC00010327	2010-11-01	OS	01098428957
# 자스민	DR20100032	LC00010192	2010-03-01	GS	01023981922
# 벨	DR20100039	LC00010562	2010-07-01	GS	01058390758
# SQL을 실행하면 다음과 같이 출력되어야 합니다.

# DR_NAME	DR_ID	MCDP_CD	HIRE_YMD
# 니모	DR20200012	CS	2020-03-01
# 뽀로로	DR20170123	GS	2017-03-01
# 벨	DR20100039	GS	2010-07-01
# 자스민	DR20100032	GS	2010-03-01
# 패티	DR20090001	CS	2009-07-01
# 루피	DR20090029	CS	2009-03-01

# 주의사항
# 날짜 포맷은 예시와 동일하게 나와야합니다.

1) 내 코드

In [ ]:
# SELECT DR_NAME, DR_ID, MCDP_CD, DATE_FORMAT(HIRE_YMD, '%Y-%m-%d')
# FROM DOCTOR
# WHERE MCDP_CD = 'GS'
# OR MCDP_CD = 'CS'
# ORDER BY HIRE_YMD DESC, DR_NAME ASC

# **23. 조건에 맞는 아이템들의 가격의 총합 구하기(250213)(SUN, MAX, MIN)**

In [ ]:
# 문제 설명
# 다음은 어느 한 게임에서 사용되는 아이템들의 아이템 정보를 담은 ITEM_INFO 테이블입니다.
# ITEM_INFO 테이블은 다음과 같으며, ITEM_ID, ITEM_NAME, RARITY, PRICE는 각각 아이템 ID, 아이템 명, 아이템의 희귀도, 아이템의 가격을 나타냅니다.

# Column name	Type	Nullable
# ITEM_ID	INTEGER	FALSE
# ITEM_NAME	VARCHAR(N)	FALSE
# RARITY	INTEGER	FALSE
# PRICE	INTEGER	FALSE
# 문제
# ITEM_INFO 테이블에서 희귀도가 'LEGEND'인 아이템들의 가격의 총합을 구하는 SQL문을 작성해 주세요.
# 이때 컬럼명은 'TOTAL_PRICE'로 지정해 주세요.

# 예시
# 예를 들어 ITEM_INFO 테이블이 다음과 같다면

# ITEM_ID	ITEM_NAME	RARITY	PRICE
# 0	ITEM_A	COMMON	10000
# 1	ITEM_B	LEGEND	9000
# 2	ITEM_C	LEGEND	11000
# 3	ITEM_D	UNIQUE	10000
# 4	ITEM_E	LEGEND	12000
# 조건에 해당되는 아이템의 아이템 ID는 1, 2, 4이며 각 아이템들의 가격은 9000, 11000, 12000 이므로 조건에 해당되는 아이템들의 가격의 합은 다음과 같습니다.

# TOTAL_PRICE
# 32000

1) 내 코드

In [ ]:
# SELECT SUM(PRICE) AS TOTAL_PRICE
# FROM ITEM_INFO
# WHERE RARITY = 'LEGEND'

# **24. 카테고리별 상품 개수 구하기(250217)(String, Date)**

In [ ]:
# 문제 설명
# 다음은 어느 의류 쇼핑몰에서 판매중인 상품들의 정보를 담은 PRODUCT 테이블입니다.
# PRODUCT 테이블은 아래와 같은 구조로 되어있으며, PRODUCT_ID, PRODUCT_CODE, PRICE는 각각 상품 ID, 상품코드, 판매가를 나타냅니다.

# Column name	Type	Nullable
# PRODUCT_ID	INTEGER	FALSE
# PRODUCT_CODE	VARCHAR(8)	FALSE
# PRICE	INTEGER	FALSE
# 상품 별로 중복되지 않는 8자리 상품코드 값을 가지며, 앞 2자리는 카테고리 코드를 의미합니다.

# 문제
# PRODUCT 테이블에서 상품 카테고리 코드(PRODUCT_CODE 앞 2자리) 별 상품 개수를 출력하는 SQL문을 작성해주세요. 결과는 상품 카테고리 코드를 기준으로 오름차순 정렬해주세요.

# 예시
# 예를 들어 PRODUCT 테이블이 다음과 같다면

# PRODUCT_ID	PRODUCT_CODE	PRICE
# 1	A1000011	10000
# 2	A1000045	9000
# 3	C3000002	22000
# 4	C3000006	15000
# 5	C3000010	30000
# 6	K1000023	17000
# 상품 카테고리 코드 별 상품은 아래와 같으므로,

# A1: PRODUCT_ID가 1, 2 인 상품
# C3: PRODUCT_ID가 3, 4, 5 인 상품
# K1: PRODUCT_ID가 6 인 상품
# 다음과 같은 결과가 나와야 합니다.

# CATEGORY	PRODUCTS
# A1	2
# C3	3
# K1	1

1) 내가 쓴 코드

In [ ]:
# SELECT LEFT(PRODUCT_CODE, 2) as CATEGORY, COUNT(*) as PRODUCTS
# FROM PRODUCT
# GROUP BY LEFT(PRODUCT_CODE, 2)
# ORDER BY PRODUCT_CODE

# **25. 진료과별 총 예약 횟수 출력하기(250218)(GROUP BY)**

In [ ]:
# 문제 설명
# 다음은 종합병원의 진료 예약정보를 담은 APPOINTMENT 테이블 입니다.
# APPOINTMENT 테이블은 다음과 같으며 APNT_YMD, APNT_NO, PT_NO, MCDP_CD, MDDR_ID, APNT_CNCL_YN, APNT_CNCL_YMD는
# 각각 진료예약일시, 진료예약번호, 환자번호, 진료과코드, 의사ID, 예약취소여부, 예약취소날짜를 나타냅니다.

# Column name	Type	Nullable
# APNT_YMD	TIMESTAMP	FALSE
# APNT_NO	NUMBER(5)	FALSE
# PT_NO	VARCHAR(10)	FALSE
# MCDP_CD	VARCHAR(6)	FALSE
# MDDR_ID	VARCHAR(10)	FALSE
# APNT_CNCL_YN	VARCHAR(1)	TRUE
# APNT_CNCL_YMD	DATE	TRUE
# 문제
# APPOINTMENT 테이블에서 2022년 5월에 예약한 환자 수를 진료과코드 별로 조회하는 SQL문을 작성해주세요.
# 이때, 컬럼명은 '진료과 코드', '5월예약건수'로 지정해주시고 결과는 진료과별 예약한 환자 수를 기준으로 오름차순 정렬하고,
# 예약한 환자 수가 같다면 진료과 코드를 기준으로 오름차순 정렬해주세요.

# 예시
# APPOINTMENT 테이블이 다음과 같을 때

# APNT_YMD	APNT_NO	PT_NO	MCDP_CD	MDDR_ID	APNT_CNCL_YN	APNT_CNCL_YMD
# 2022-04-14 09:30:00.000000	47	PT22000064	GS	DR20170123	N	NULL
# 2022-04-15 10:30:00.000000	48	PT22000065	OB	DR20100231	N	NULL
# 2022-05-15 17:30:00.000000	49	PT22000086	OB	DR20100231	N	NULL
# 2022-05-18 10:30:00.000000	52	PT22000019	GS	DR20100039	N	NULL
# 2022-05-19 12:00:00.000000	53	PT22000020	FM	DR20010112	N	NULL
# 2022-05-22 08:30:00.000000	54	PT22000021	GS	DR20100039	N	NULL
# 2022-05-04 10:30:00.000000	56	PT22000023	FM	DR20090112	N	NULL
# 2022-05-14 15:30:00.000000	57	PT22000074	CS	DR20200012	N	NULL
# 2022-05-24 15:30:00.000000	58	PT22000085	CS	DR20200012	N	NULL
# 2022-05-28 10:00:00.000000	60	PT22000092	OS	DR20100031	N	NULL
# SQL을 실행하면 다음과 같이 출력되어야 합니다.

# 진료과코드	5월예약건수
# OB	1
# OS	1
# CS	2
# FM	2
# GS	2

1) 내가 쓴 코드

In [ ]:
# SELECT MCDP_CD AS '진료과 코드', COUNT(PT_NO) AS '5월예약건수'
# FROM APPOINTMENT
# WHERE APNT_YMD >= '2022-05-01' AND APNT_YMD < '2022-06-01'
# GROUP BY MCDP_CD
# ORDER BY '5월예약건수', '진료과 코드';

# **26. 인기있는 아이스크림(250219)(SELECT)**

In [ ]:
# 문제 설명
# FIRST_HALF 테이블은 아이스크림 가게의 상반기 주문 정보를 담은 테이블입니다.
# FIRST_HALF 테이블 구조는 다음과 같으며, SHIPMENT_ID, FLAVOR, TOTAL_ORDER는
# 각각 아이스크림 공장에서 아이스크림 가게까지의 출하 번호, 아이스크림 맛, 상반기 아이스크림 총주문량을 나타냅니다.

# NAME	TYPE	NULLABLE
# SHIPMENT_ID	INT(N)	FALSE
# FLAVOR	VARCHAR(N)	FALSE
# TOTAL_ORDER	INT(N)	FALSE

# 문제
# 상반기에 판매된 아이스크림의 맛을 총주문량을 기준으로 내림차순 정렬하고 총주문량이 같다면 출하 번호를 기준으로 오름차순 정렬하여 조회하는 SQL 문을 작성해주세요.

# 예시
# 예를 들어 FIRST_HALF 테이블이 다음과 같을 때

# SHIPMENT_ID	FLAVOR	TOTAL_ORDER
# 101	chocolate	3200
# 102	vanilla	2800
# 103	mint_chocolate	1700
# 104	caramel	2600
# 105	white_chocolate	3100
# 106	peach	2450
# 107	watermelon	2150
# 108	mango	2900
# 109	strawberry	3100
# 110	melon	3150
# 111	orange	2900
# 112	pineapple	2900
# 상반기 아이스크림 맛을 총주문량을 기준으로 내림차순 정렬하고 총주문량이 같은 경우 출하 번호를 기준으로 오름차순 정렬하면
# chocolate, melon, white_chocolate, strawberry, mango, orange, pineapple, vanilla, caramel, peach, watermelon, mint_chocolate 순서대로 조회되어야 합니다.
# 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# FLAVOR
# chocolate
# melon
# white_chocolate
# strawberry
# mango
# orange
# pineapple
# vanilla
# caramel
# peach
# watermelon
# mint_chocolate

1) 내 코드

In [ ]:
# SELECT FLAVOR
# FROM FIRST_HALF
# ORDER BY TOTAL_ORDER DESC, SHIPMENT_ID ASC

# **27. 12세 이하인 여자 환자 목록 출력하기(250221)(SELECT)**

In [ ]:
# 문제 설명
# 다음은 종합병원에 등록된 환자정보를 담은 PATIENT 테이블입니다.
# PATIENT 테이블은 다음과 같으며 PT_NO, PT_NAME, GEND_CD, AGE, TLNO는 각각 환자번호, 환자이름, 성별코드, 나이, 전화번호를 의미합니다.

# Column name	Type	Nullable
# PT_NO	VARCHAR(10)	FALSE
# PT_NAME	VARCHAR(20)	FALSE
# GEND_CD	VARCHAR(1)	FALSE
# AGE	INTEGER	FALSE
# TLNO	VARCHAR(50)	TRUE
# 문제
# PATIENT 테이블에서 12세 이하인 여자환자의 환자이름, 환자번호, 성별코드, 나이, 전화번호를 조회하는 SQL문을 작성해주세요.
# 이때 전화번호가 없는 경우, 'NONE'으로 출력시켜 주시고 결과는 나이를 기준으로 내림차순 정렬하고, 나이 같다면 환자이름을 기준으로 오름차순 정렬해주세요.

# 예시
# PATIENT 테이블이 다음과 같을 때

# PT_NO	PT_NAME	GEND_CD	AGE	TLNO
# PT22000003	브라운	M	18	01031246641
# PT22000004	크롱	M	7	NULL
# PT22000006	뽀뽀	W	8	NULL
# PT22000009	한나	W	12	01032323117
# PT22000012	뿡뿡이	M	5	NULL
# PT22000013	크리스	M	30	01059341192
# PT22000014	토프	W	22	01039458213
# PT22000018	안나	W	11	NULL
# PT22000019	바라	W	10	01079068799
# PT22000021	릴로	W	33	01023290767
# SQL을 실행하면 다음과 같이 출력되어야 합니다.

# PT_NAME	PT_NO	GEND_CD	AGE	TLNO
# 한나	PT22000009	W	12	01032323117
# 안나	PT22000018	W	11	NONE
# 바라	PT22000019	W	10	01079068799
# 뽀뽀	PT22000006	W	8	NONE

1) 내 코드

In [ ]:
# SELECT PT_NAME, PT_NO, GEND_CD, AGE, IFNULL(TLNO, 'NONE')
# FROM PATIENT
# WHERE AGE <= '12'
# AND   GEND_CD = 'W'
# ORDER BY AGE DESC, PT_NAME ASC

# **28. 중성화 여부 파악하기(250224)(String, Date)**(검색 도움)

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 보호소의 동물이 중성화되었는지 아닌지 파악하려 합니다. 중성화된 동물은 SEX_UPON_INTAKE 컬럼에 'Neutered' 또는 'Spayed'라는 단어가 들어있습니다.
# 동물의 아이디와 이름, 중성화 여부를 아이디 순으로 조회하는 SQL문을 작성해주세요. 이때 중성화가 되어있다면 'O', 아니라면 'X'라고 표시해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A355753	Dog	2015-09-10 13:14:00	Normal	Elijah	Neutered Male
# A373219	Cat	2014-07-29 11:43:00	Normal	Ella	Spayed Female
# A382192	Dog	2015-03-13 13:14:00	Normal	Maxwell 2	Intact Male
# 중성화한 동물: Elijah, Ella
# 중성화하지 않은 동물: Maxwell 2
# 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_ID	NAME	중성화
# A355753	Elijah	O
# A373219	Ella	O
# A382192	Maxwell 2	X
# ※ 컬럼 이름은 일치하지 않아도 됩니다.

1) 내가 쓴 코드

In [ ]:
# SELECT ANIMAL_ID, NAME,
#        CASE
#            WHEN SEX_UPON_INTAKE LIKE 'Neutered%' OR SEX_UPON_INTAKE LIKE 'Spayed%' THEN 'O'
#            ELSE 'X'
#        END AS 중성화
# FROM ANIMAL_INS
# ORDER BY ANIMAL_ID;

# **29. 고양이와 개는 몇 마리 있을까(250225)(GROUP BY)**

In [ ]:
# 문제 설명
# ANIMAL_INS 테이블은 동물 보호소에 들어온 동물의 정보를 담은 테이블입니다.
# ANIMAL_INS 테이블 구조는 다음과 같으며, ANIMAL_ID, ANIMAL_TYPE, DATETIME, INTAKE_CONDITION, NAME, SEX_UPON_INTAKE는
# 각각 동물의 아이디, 생물 종, 보호 시작일, 보호 시작 시 상태, 이름, 성별 및 중성화 여부를 나타냅니다.

# NAME	TYPE	NULLABLE
# ANIMAL_ID	VARCHAR(N)	FALSE
# ANIMAL_TYPE	VARCHAR(N)	FALSE
# DATETIME	DATETIME	FALSE
# INTAKE_CONDITION	VARCHAR(N)	FALSE
# NAME	VARCHAR(N)	TRUE
# SEX_UPON_INTAKE	VARCHAR(N)	FALSE
# 동물 보호소에 들어온 동물 중 고양이와 개가 각각 몇 마리인지 조회하는 SQL문을 작성해주세요. 이때 고양이를 개보다 먼저 조회해주세요.

# 예시
# 예를 들어 ANIMAL_INS 테이블이 다음과 같다면

# ANIMAL_ID	ANIMAL_TYPE	DATETIME	INTAKE_CONDITION	NAME	SEX_UPON_INTAKE
# A373219	Cat	2014-07-29 11:43:00	Normal	Ella	Spayed Female
# A377750	Dog	2017-10-25 17:17:00	Normal	Lucy	Spayed Female
# A354540	Cat	2014-12-11 11:48:00	Normal	Tux	Neutered Male
# 고양이는 2마리, 개는 1마리 들어왔습니다. 따라서 SQL문을 실행하면 다음과 같이 나와야 합니다.

# ANIMAL_TYPE	count
# Cat	2
# Dog	1

1) 내가 쓴 코드

In [ ]:
# SELECT ANIMAL_TYPE, COUNT(ANIMAL_TYPE) as 'count'
# FROM ANIMAL_INS
# GROUP BY ANIMAL_TYPE
# ORDER BY ANIMAL_TYPE